# **Task 2**

In [1]:
import numpy as np
import pandas as pd
from sklearn import preprocessing

import warnings
warnings.filterwarnings("ignore")

import mysql.connector

### **1. Read the csv or excel file.**

In [2]:
data = pd.read_csv(r'used_bikes.csv')
data.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    float64
 2   city        149 non-null    object
 3   kms_driven  149 non-null    float64
 4   owner       149 non-null    object
 5   age         149 non-null    float64
 6   power       149 non-null    float64
 7   brand       149 non-null    object
dtypes: float64(4), object(4)
memory usage: 9.4+ KB

### **2. Change the datatypes of the column and check the memory usage before and after the change in the data types.**

#### **Check Memory Usage : Before...**

In [4]:
# memory usage of each column...
memory_before = data.memory_usage(index=False, deep=True).sum()
memory_before

45929

**Some possible way to change the Datatype to reduce space...**

**1. By Changing 'Age' column, float64 to int8.**

**2. By changing 'Owner' column, object to int32. using Lebel Encoding**

**3. By changing 'Power' & 'Price' columns, float64 to int32, because there are no decimal value.**

**4. By removing Brand name from 'Bike_Name' column, as we have in 'Brand' column name too.**

**5. By Changing the format of 'City', from full name to 3 letter code word. Ex.: Ahmedabad => ADI.  If Required**

In [5]:
# Check range, max values...
print("Max age :", max(data["age"]))
print("Max power :", max(data['power']))
print("Max price :", max(data['price']))
print("Max kms_driven :", max(data['kms_driven']))

Max age : 16.0
Max power : 1299.0
Max price : 1350000.0
Max kms_driven : 357000.0

In [6]:
# 1. By Changing 'Age' column, float64 to int8...
data['age'] = data['age'].astype(np.int8)

In [7]:
# 2. By changing 'Owner' column, object to int32, using Lebel Encoding...
data['owner'].nunique() # there are 3 labels...

3

In [8]:
# So, we can apply, lebel encoding...
label_encoder = preprocessing.LabelEncoder()  # Object...

data['owner'] = label_encoder.fit_transform(data['owner'])

In [9]:
# 3. By changing 'Power' & 'Price' columns, float64 to int32, because there are no decimal value...

data['power'] = data['power'].astype(np.int16)
data['price'] = data['price'].astype(int)

In [10]:
# 4. By removing Brand name from 'Bike_Name' column, as we have in 'Brand' column name too...

for i in range(len(data['brand'])):
    data['bike_name'][i] = data['bike_name'][i].replace(data['brand'][i], "").strip()

In [11]:
# Altered DataFrame...
data_new = data[['brand', 'bike_name', 'price', 'city',	'kms_driven', 'owner', 'age', 'power']]

In [12]:
data_new.sample(8)

,brand,bike_name,price,city,kms_driven,owner,age,power
138,Bajaj,Pulsar 220cc,55000,Bangalore,32734.0,0,6,220
139,Royal Enfield,Himalayan 410cc Fi ABS,173300,Vadodara,14000.0,0,2,410
29,Honda,X-Blade 160CC ABS,81200,Mettur,9100.0,0,2,160
87,Bajaj,Pulsar 220F,40000,Mumbai,27000.0,0,7,220
53,Honda,CB Shine 125cc,21900,Gorakhpur,30000.0,1,7,125
91,Bajaj,Pulsar NS200,75000,Bangalore,11575.0,0,4,200
80,Yamaha,YZF-R15 2.0 150cc,82000,Mumbai,4300.0,1,3,150
24,Yamaha,FZ V 2.0 150cc,45000,Delhi,23000.0,0,6,150

In [13]:
data_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   brand       149 non-null    object
 1   bike_name   149 non-null    object
 2   price       149 non-null    int32
 3   city        149 non-null    object
 4   kms_driven  149 non-null    float64
 5   owner       149 non-null    int32
 6   age         149 non-null    int8
 7   power       149 non-null    int16
dtypes: float64(1), int16(1), int32(2), int8(1), object(3)
memory usage: 6.4+ KB

In [14]:
# memory usage by final data...
memory_after = data_new.memory_usage(index=False, deep=True).sum()
memory_after

32663

In [15]:
# Memory Reduced of data...
print("Total Reduced Memory : ", abs(memory_before-memory_after) , 'Bytes')

Total Reduced Memory :  13266 Bytes

In [16]:
'# Done...'

'# Done...'

In [17]:
data_new.reset_index(drop=True, inplace=True)

In [18]:
data_new.head()

,brand,bike_name,price,city,kms_driven,owner,age,power
0,TVS,Star City Plus Dual Tone 110cc,35000,Ahmedabad,17654.0,0,3,110
1,Royal Enfield,Classic 350cc,119900,Delhi,11000.0,0,4,350
2,Triumph,Daytona 675R,600000,Delhi,110.0,0,8,675
3,TVS,Apache RTR 180cc,65000,Bangalore,16329.0,0,4,180
4,Yamaha,FZ S V 2.0 150cc-Ltd. Edition,80000,Bangalore,10000.0,0,3,150

In [19]:
m = 0
for i in data['brand']:
    if len(i) > m:
        m = len(i)
        
m

15

### **3. Dump the data into the mysql database.**

In [26]:
# Note : After connecting to MySQL, we created and Database and now we are using it...

# sql connect...
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="*********",  # Add your password...
    database="neenopal"
)

cursor = mydb.cursor()

In [23]:
# Create Database neenopal...
cursor.execute("CREATE DATABASE neenopal")  # Don't need to run again...

In [27]:
# Create Table used_bikes...
cursor.execute("create table used_bikes(brand varchar(20),"
               "bike_name varchar(50),"
               "price float8,"
               "city varchar(20),"
               "kms_driven float8,"
               "owner varchar(20),"
               "age int,"
               "power int)")

In [28]:
table_name = 'used_bikes'
column_name = 'brand'


cursor.execute(f"SHOW INDEX FROM {table_name} WHERE Key_name='idx_{column_name}'")
index_exists = cursor.fetchall()

# drop index...
if index_exists:
    cursor.execute(f"DROP INDEX idx_{column_name} ON {table_name}")

# inserting data...
data_tuples = [tuple(row) for row in data_new.values]


sql_insert = f"INSERT INTO {table_name}(brand, bike_name, price, city, kms_driven, owner, age, power) VALUES (%s, " \
             f"%s, %s, %s, %s, %s, %s, %s) "


cursor.executemany(sql_insert, data_tuples)

# inserting index...
cursor.execute(f"CREATE INDEX idx_{column_name} ON {table_name}({column_name})")

In [29]:
# Fetch the data from the table...
query = f"SELECT * FROM used_bikes"
result_df = pd.read_sql_query(query, mydb)

In [30]:
result_df.head()

,brand,bike_name,price,city,kms_driven,owner,age,power
0,TVS,Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,0,3,110
1,Royal Enfield,Classic 350cc,119900.0,Delhi,11000.0,0,4,350
2,Triumph,Daytona 675R,600000.0,Delhi,110.0,0,8,675
3,TVS,Apache RTR 180cc,65000.0,Bangalore,16329.0,0,4,180
4,Yamaha,FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,0,3,150

In [31]:
cursor.close()
mydb.close()

In [32]:
'# Done ...'

'# Done ...'